In [2]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

In [4]:
df_left = DataFrame({'key':['X','Y','Z','X','Y'],'data':range(5)})

In [5]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4

In [7]:
df_right = DataFrame({'group_data':[10,20]},index=['X','Y'])

In [8]:
df_right

   group_data
X          10
Y          20

In [9]:
pd.merge(df_left,df_right,left_on='key',right_index=True)

  key  data  group_data
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

In [10]:
df_left_hr = DataFrame({'key1':['sf','sf','sf','la','la'],
                       'key2':[10,20,20,20,30],
                       'data_Set':np.arange(5)})

In [11]:
df_left_hr

  key1  key2  data_Set
0   sf    10         0
1   sf    20         1
2   sf    20         2
3   la    20         3
4   la    30         4

In [16]:
df_right_hr =DataFrame(np.arange(10).reshape(5,2),
                       index=[['la','la','sf','sf','sf'],
                      [10,20,10,10,20]],
                      columns=['col1','col2'])

In [17]:
df_right_hr

       col1  col2
la 10     0     1
   20     2     3
sf 10     4     5
   10     6     7
   20     8     9

In [18]:
pd.merge(df_left_hr,df_right_hr,left_on=['key1','key2'],right_index=True)

  key1  key2  data_Set  col1  col2
0   sf    10         0     4     5
0   sf    10         0     6     7
1   sf    20         1     8     9
2   sf    20         2     8     9
3   la    20         3     2     3

In [20]:
df_left.join(df_right)

  key  data  group_data
0   X     0         NaN
1   Y     1         NaN
2   Z     2         NaN
3   X     3         NaN
4   Y     4         NaN

In [21]:
df_right

   group_data
X          10
Y          20

In [22]:
df_left

  key  data
0   X     0
1   Y     1
2   Z     2
3   X     3
4   Y     4